# Max из 2
a = int(input())
b = int(input())
if a>b:
    print(a)
else:
    print(b)


# Вывести какое число
a = int(input())
if a%2 == 0:
    print('chetnoe')
else:
    print('ne chetnoe')



a = int(input())
if a%2 == 0 and a % 3 == 0:  # Если будет делится на 2 но не на 3 то получим No
    print('Yes')
else:
    print('No')


