# Еще один тип данных в Python является логический тип Boolean
# True False (2 значение либо истина либо ложь)
# Будет применятся при любом сравнение
print(2 == 2)
print(2 >= 2)
print(6 <= 4)
print('Операторы сравнения > < >= >=  == != ')
x = 4
print(x == 6)
# Проверка на четность
print(x % 2 == 0)
# Напишем не четное число , получим False
x = 73
print((x % 2 == 0))
# Проверим на кратность 4
x = 4
print(x % 4 == 0)

# Проверка на не кратность 4
print(x % 4 != 0)
not x % 4 == 0
print('И ИЛИ НЕ ')
a =4;b =4
print(a>3 and b > 3) # Оба верны
print(a > 3 or b < 3) # 1 из 2 верен
a >= 18 and a <= 27
a =517
print(a%10==7) # %10 Получаем последнюю цифру
##not
##and
##or

