# ПЕРЕМЕННАЯ
# Чтобы создать переменную мы должны положить в нее значение
name = 'Андрей' #= Оператор присваивания, ( Связывание ИМЕНИ С ОБЪЕКТОМ) Имя может перепривязатся к другому обьекту
age = 5

c = 1 # Тем самым создали переменную с , ПЕРЕМЕННЫЕ Создаются в момент первого его присвоения
print(name,age,c)

# 1 Имя (идентификатор)
# 2 Значение переменной
# 3 Тип переменной(тип обьекта)
_aaa = 2; a1 = 2; aAaa = 3; a=2; name =3; age = 5; mo_ney =3
print(_aaa)
#          ссылка   Jбьект               ( Динамическая типимизация, может принимать значения любых типов)
#  a = 2;   <----     2     типа  Int
#  a = 5.4  <----     5.4   типа float
#  a = 'hi' <----     hi    типa str

