# for i in range(1,6):
#         print(i,' Приготовить Кофе')
#         print(i,' Помыть кружку')
#         if i <2:
#             print(i," **** НАСРАЛ **** ")

kol = 0
spisok = ['Пластик', 'Пластик', 'Метал', 'Пластик', 'Бумага', 'Карандаш', 'Пластик', 'Металл', 'Пластик']
for i in range(len(spisok)):
    if spisok[i] == 'Пластик':
        kol = kol + 1
        print(spisok[i], kol, i, 'под индексом')
print(kol)
print(spisok.count('Пластик'))  # Метод списка

spisok = ['Пластик', 'Пластик', 'Металл', 'Пластик', 'Бумага', 'Карандаш', 'Пластик', 'Металл', 'Пластик']
print(set(spisok))  # Не упорядочная коллекция уберет дубли
