# Вычислите квадратный корень числа 50
a = 50
print(a*a)