# У Pythona очень простой синтаксис . на нем очень легко как писать программы так и читать.

# Python является кросплатформенным , программа запущенная на windows легко запустится на любой другой ОС Mac ? linux
# Python очень многофункциональный, у него очень много библиотек, можно написать Desctop приложения , web, игры ,
# скрипты , ботов под сайты, Нанем проходят олимпиадное программирнование ЕГЭ. актуальная версия 3
# https://www.python.org/downloads/release/python-381/   запускаем жмем add python patch  ручная установка изменим путь установки
# Python37