# Деление нацело и деление по остатку
# Давайте начнем с деления нацело. В Python данная операция обозначается знаком двойного слеша //.

# "Cколько раз второе число  умещается в первое?"
print(21//5)
print(37//10)
print(42//6)
print(5//8)
print(17956//1000)
print(37//8)

# Остаток от деления
#"Сколько останется от первого числа после того, как в него максимальное количество раз уместится второе число?"
print(31%5,'31 %5 Остаток от деления')
print(89%10,'89 %10 Остаток от деления')
print(35%7)
print(5%13)
print(8541%100)
print(37%8)