# Сколько слов в этой строке
s = input()
print(len(s.split()),s)


# Сколько слов в этой строке
s ='helloworld'
print(s.count(' '))
