# Зачача №2945. Следующее четное
# Дано целое число n. Выведите следующее за ним четное число.
# При решении этой задачи нельзя использовать условную инструкцию if и циклы.

a=int(input())
print(str(round(a+1.5)))