# print('Введите 6 фамилий учеников в 1м классе')
# g = []
# f = []
# for i in range(6):
#     a = input()
#     g.append(a)
# print('Введите 4 фамилий учеников во 2м классе')
# for i in range(4):
#     b = input()
#     f.append(b)
# g = g+f
# print('Фамилии учеников в обновлённом классе')
# print(sorted(g))

# s = 0
# print('Добавить')
# print('Введите фамилию')
# a = input()
# print('Гражданин',a,'добавлен в очередь')
# s = s+1
# print('Добавить')
# print('Введите фамилию')
# b = input()
# print('Гражданин',b,'добавлен в очередь')
# print('Добавить')
# print('Введите фамилию')
# c = input()
# print('Гражданин',c,'добавлен в очередь')
# print('На данный момент в очереди зарегистрировано',s,'человек')
# print('Текущий')
# print('Первое место в очереди у гражданина:',a)
# print('Найти')
# print('Введите фамилию')
# d = input()
# print('Гражданин',d)
# print('Позиция в очереди:',s)
# print('Следующий')
# print('Количество')
# print('На данный момент в очереди зарегистрировано',s,'человек')

# f = []
# while True:
#     a = input()
#     if a == 'добавить':
#         print('Введите фамилию')
#         b = input()
#         f.append(b)
#     if a == 'следующий':
#         print(f[0])
#         f = f[1:]
#     if a == 'количество':
#         print(len(f))
#     if a == 'стоп':
#         print('досвидания')
#         break