b = 0
f = 0
d = 0
import random
g = ['камень','ножницы','бумага']
while True:
    ch = random.randint(1, 3)
    if ch == 1:
        ch = 'камень'
    if ch == 2:
        ch = 'ножницы'
    if ch == 3:
        ch = 'бумага'
    a = input('Ваш ход: ')
    print('Компьютер выбрал:',ch)
    if a == 'камень' and ch == 'ножницы':
        print('Результат: Вы победили!')
        b = b + 1
    if a == 'ножницы' and ch == 'бумага':
        print('Результат: Вы победили!')
        b = b + 1
    if a == 'бумага' and ch == 'камень':
        print('Результат: Вы победили!')
        b = b + 1
    if a == 'камень' and ch == 'бумага':
        print('Результат: Вы проиграли')
        f = f + 1
    if a == 'ножницы' and ch == 'камень':
        print('Результат: Вы проиграли')
        f = f + 1
    if a == 'бумага' and ch == 'ножницы':
        print('Результат: Вы проиграли')
        f = f + 1
    if a == 'камень' and ch == 'камень':
        print('Результат: Ничья!')
        d = d + 1
    if a == 'ножницы' and ch == 'ножницы':
        print('Результат: Ничья!')
        d = d + 1
    if a == 'бумага' and ch == 'бумага':
        print('Результат: Ничья!')
        d = d + 1
    if a == 'стоп':
        print('Игра завершена.')
        print('Статистика:')
        print('Побед:',b)
        print('Поражений:',f)
        print('Ничьих:',d)
        break