# 1) Отменить последнее действие Ctrl + Z
# 2) Отменить последнюю отмену действия Ctrl + Shift + Z
# 3) Расширенная вставка из буфера обмена (с историей) Ctrl + Shift + V
# 4) Инкрементальное выделение выражения Ctrl (+ Shift) + W
# 5) Перемещение между словами Ctrl + влево/вправо
# 6) Прокрутка кода без изменения позиции курсора Ctrl + вверх/вниз
# 7) Переход в начало/конец файла Ctrl + Home/End
# 8) Удаление строки, отличие в том, где потом окажется курсор Shift + Del (Ctrl + Y)
# 9) Удалить от текущей позиции до конца слова Ctrl + Del
# 10) Удалить от текущей позиции до начала слова Ctrl + Backspace
# 11) Дублировать текущую строку Ctrl + D
# 12) Увеличить / уменьшить текущий отступ Tab / Shift + Tab
# 13) Выравнивание отступов в коде Ctrl + Alt + I
# 14) Приведение кода в соответствие Code-Style Ctrl + Alt + L
# 15) Закомментировать/раскомментировать текущую строку Ctrl + /
# 16) Закомментировать/раскомментировать выделенный код Ctrl + Shift +
# 17) Фолдинг, свернуть/развернуть Ctrl + -/+
# 18) Фолдинг, свернуть/развернуть все Ctrl + Shift + -/+
# 19) Сделать текущий скоуп сворачиваемым и свернуть его Ctrl + Shift + .
# 20) Сделать текущий скоуп несворачиваемым Ctrl + .
# 21) Замена в тексте Ctrl + R
# 22) Замена во всех файлах Ctrl + Shift + R
