# git clone                 # https://github.com/nikita-chudnovskiy/ProjectPyton.git # Путь где хран наш проект
# git add.                  # Для нужных файлов
# git commit -m "fix"       # Передать новую версию файла 2 11

# Гит существует понятие Веток 2 разных программиста

# git branch Vetka1         # Создает свою ветку а потом на нее переключиться
# git branch Vetka2

# git checkout vetka1       # Переключится на ветку чтоб в ней работать (теперь комитить будем в ней)
# git push origin vetka1    # Загрузить изминения на сервер в нашей ветке

# git pull origin vetka1    # Другой программист загрузит себе ветку
# GIT REBASE MASTER         # Из нашей ветки перенесет в основной ПРОЕКТ

# git rvert zrner№КОМИТА    # Отменит все изменения в комите переданного


«Джентльменским набором» для работы в Git можно считать набор команд:

●	git commit — фиксация изменений
●	git diff — просмотр актуальных или предыдущих изменений в рамках работы над репозиторием
●	git checkout — переход на предыдущее состояние или ветку
●	git push/pull — отправка и получение изменений из удалённого репозитория
●	git stash — сохранение изменений в архив для последующего использования






# which git Найти где - обычно на mac /usr/bin/git